-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Дек 21 2023 г., 03:06
-- Версия сервера: 8.0.30
-- Версия PHP: 7.2.34

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `comics`
--

-- --------------------------------------------------------

--
-- Структура таблицы `readComic`
--

CREATE TABLE `readComic` (
  `id` int NOT NULL,
  `name` text COLLATE utf8mb4_general_ci NOT NULL,
  `title` text COLLATE utf8mb4_general_ci NOT NULL,
  `composition` text COLLATE utf8mb4_general_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `readComic`
--

INSERT INTO `readComic` (`id`, `name`, `title`, `composition`) VALUES
(1, 'Дима', 'Космос', 'Рик и Морти отправились в захватывающее космическое приключение. Они получили сигнал из далекой галактики, указывающий на наличие загадочного артефакта, способного изменить ход вселенной. Не смысля ждать, парни немедленно запрыгнули в свой космический корабль и отправились в далекий угол галактики.\r\n\r\nПо прибытии на место, Рик и Морти обнаружили, что артефакт хранится на заброшенной космической станции. Они вошли внутрь и столкнулись с рядом смертельных ловушек и враждебных существ. Но ничто не могло остановить их стремление получить артефакт.\r\n\r\nВо время своего путешествия по станции, Рик и Морти столкнулись с необычным инопланетным существом. Оно оказалось последним хранителем артефакта и было готово сражаться до последнего. Однако, с помощью своего умения быстро думать и совместной работы, Рик и Морти смогли победить существо и получить артефакт.\r\n\r\nНо когда они взяли артефакт в руки, произошло нечто непредвиденное. Они оказались втянуты в черную дыру, которая телепортировала их в неизвестное место в галактике. Теперь Рику и Морти предстоит разгадать загадку этого места и найти способ вернуться домой.\r\n\r\nВо время своих приключений в космосе, Рик и Морти столкнутся с разнообразными инопланетными расами, опасными астрономическими явлениями и неожиданными поворотами сюжета. Но с помощью своего остроумия и дружбы, они смогут преодолеть все трудности и вернуться домой в свой привычный мир.\r\n\r\nТак началась их захватывающая история в космосе, полная опасностей, смеха и неожиданных открытий. Рик и Морти докажут, что независимо от места и времени, их дружба и смелость всегда победят любые преграды.'),
(2, 'Никита', 'НЛО', 'Рик и Морти отправились в захватывающее космическое приключение. Они получили сигнал из далекой галактики, указывающий на наличие загадочного артефакта, способного изменить ход вселенной. Не смысля ждать, парни немедленно запрыгнули в свой космический корабль и отправились в далекий угол галактики.\r\n\r\nПо прибытии на место, Рик и Морти обнаружили, что артефакт хранится на заброшенной космической станции. Они вошли внутрь и столкнулись с рядом смертельных ловушек и враждебных существ. Но ничто не могло остановить их стремление получить артефакт.\r\n\r\nВо время своего путешествия по станции, Рик и Морти столкнулись с необычным инопланетным существом. Оно оказалось последним хранителем артефакта и было готово сражаться до последнего. Однако, с помощью своего умения быстро думать и совместной работы, Рик и Морти смогли победить существо и получить артефакт.\r\n\r\nНо когда они взяли артефакт в руки, произошло нечто непредвиденное. Они оказались втянуты в черную дыру, которая телепортировала их в неизвестное место в галактике. Теперь Рику и Морти предстоит разгадать загадку этого места и найти способ вернуться домой.\r\n\r\nВо время своих приключений в космосе, Рик и Морти столкнутся с разнообразными инопланетными расами, опасными астрономическими явлениями и неожиданными поворотами сюжета. Но с помощью своего остроумия и дружбы, они смогут преодолеть все трудности и вернуться домой в свой привычный мир.\r\n\r\nТак началась их захватывающая история в космосе, полная опасностей, смеха и неожиданных открытий. Рик и Морти докажут, что независимо от места и времени, их дружба и смелость всегда победят любые преграды.'),
(3, 'Никита', 'НЛО', 'Рик и Морти отправились в захватывающее космическое приключение. Они получили сигнал из далекой галактики, указывающий на наличие загадочного артефакта, способного изменить ход вселенной. Не смысля ждать, парни немедленно запрыгнули в свой космический корабль и отправились в далекий угол галактики.\r\n\r\nПо прибытии на место, Рик и Морти обнаружили, что артефакт хранится на заброшенной космической станции. Они вошли внутрь и столкнулись с рядом смертельных ловушек и враждебных существ. Но ничто не могло остановить их стремление получить артефакт.\r\n\r\nВо время своего путешествия по станции, Рик и Морти столкнулись с необычным инопланетным существом. Оно оказалось последним хранителем артефакта и было готово сражаться до последнего. Однако, с помощью своего умения быстро думать и совместной работы, Рик и Морти смогли победить существо и получить артефакт.\r\n\r\nНо когда они взяли артефакт в руки, произошло нечто непредвиденное. Они оказались втянуты в черную дыру, которая телепортировала их в неизвестное место в галактике. Теперь Рику и Морти предстоит разгадать загадку этого места и найти способ вернуться домой.\r\n\r\nВо время своих приключений в космосе, Рик и Морти столкнутся с разнообразными инопланетными расами, опасными астрономическими явлениями и неожиданными поворотами сюжета. Но с помощью своего остроумия и дружбы, они смогут преодолеть все трудности и вернуться домой в свой привычный мир.\r\n\r\nТак началась их захватывающая история в космосе, полная опасностей, смеха и неожиданных открытий. Рик и Морти докажут, что независимо от места и времени, их дружба и смелость всегда победят любые преграды.'),
(4, 'ф', 'ф', ' ф'),
(5, 'Гефест', 'Человечки', ' ыфвфывфвыыыыыыыыыыыыыыыыыыыыыыыыыыыыыыыыыыыыыыыыыыыыыыыыыыыы');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `readComic`
--
ALTER TABLE `readComic`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `readComic`
--
ALTER TABLE `readComic`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
