<!DOCTYPE html>
<html>
	<head>
		<meta charset="UTF-8">
		<title>AboutTheJoker</title>
        <link href="style.css" rel="stylesheet" type="text/css"/>
	</head>
	<body>
		<div class = "content">
			<div class = "top">
				<h1>About the joker</h1>
			</div>
			<div class = "center">
				<h1>1) Происхождение</h1>
				<h3>
					Есть несколько различных версий происхождения Джокера,
					но все они основываются на самой первой подобной истории,
					описанной в “Detective Comics #168” 1951 года. 
					Будучи обычным криминальным элементом, персонаж столкнулся
					с Бэтменом на заводе Ace Chemical и в момент побега спрыгнул 
					в чан с химикатами, которые и трансформировали его в того 
					Джокера, которого мы знаем. В большинстве версий, именно 
					благодаря “купанию” в химикатах кожа Джокера приобрела белый 
					цвет, волосы - зеленый, а его разум слетел с катушек. 
					В некоторых историях авторы винят то падение даже в его 
					продолговатой челюсти.
				</h3>
				<h1>2) Мозг</h1>
				<h3>
					Мозг Джокера уникален. Как объяснил Марсианский Охотник
					в “JLA #11” 1997 года, менее рациональное правое 
					полушарие Джокера гораздо меньше, чем аналитическое 
					левое. Природа нестабильного психологического состояния
					Джокера до сих пор не ясна, но многие психологи в 
					комиксах также относят ее к полученной травме головы во 
					время падения в чан. В графическом романе “Бэтмен: 
					Лечебница Аркхем” (1989), в котором у Джокера каждый день
					формировалась новая личность, авторы поставили своему 
					персонажу диагноз “супер безумие”.
				</h3>
				<h1>3) Улыбка</h1>
				<h3>
					Над деталями создания персонажа спорят до сих пор, но все 
					однозначно сошлись во мнении, что отличительная черта Джокера - 
					улыбка - черпала вдохновение из эры немого кино. Когда персонаж 
					создавался, Билл Фингер использовал снимок Конрада Фейдта из 
					фильма 1928 “Человек, который смеется”. По этому поводу даже 
					есть своеобразная отсылка - графический роман 2005 года “Бэтмен: 
					Человек, который смеется”. В новом веке ухмылка Джокера 
					подверглась значительным изменениям. В фильме “Темный рыцарь” 
					улыбка Хита Леджера была далеко не в 32 зуба, а ее основной 
					чертой было наличие двух шрамов по обе стороны рта. А в “Birds 
					of Prey #124” у него даже появились вставные зубы, после того как 
					родные ему выбила Барбара Гордон.
				</h3>
				<h1>4) Иммунитет к токсинам</h1>
				<h3>
					Джокеру не принадлежит звание величайшего ученного, 
					но, благодаря его ядам, его знают как одного из лучших
					химиков во вселенной DC. С первого своего появления, 
					он был замечен за смешиванием токсичных химикатов с 
					наркотиками и веселящим газом, которые заставляли его 
					жертв бледнеть и умирать с улыбкой на лице. Из-за 
					продолжительного взаимодействия с собственным ядом Д
					жокера, у персонажа развился иммунитет к нему и к 
					множеству других токсинов. В “Detective Comics #664” 
					(1993) на него не подействовал токсин страха персонажа 
					Пугало, а в кроссовере “Бэтмен и Капитан Америка” (1996) 
					Джокер остался невредимым после действия газа Красного 
					Черепа “Пыль Смерти”.
				</h3>
				<h1>5) Ядовитая кровь</h1>
				<h3>
					В игре “Бэтмен: Аркхем Cити” 2011 организм Джокера стал 
					своеобразным инкубатором для Титана, который смешавшись с 
					другими ядовитыми веществами в кровеносной системе Джокера, 
					становился смертельным для любого, принявшего его, в течении 
					24 часов. В комиксах кровь Джокера опасна сама по себе. Пьющие 
					кровь персонажа комары умирают сразу, а в “Бэтмен и Робин 
					#14” (2010) Робина парализовало, когда во время сражения с 
					Джокером, на него упало пара капель его крови.
				</h3>
			</div>
			<div class = "buttom">
				<h1>Слова Джокера</h1>
				<h3 id = "quotes">

				</h3>
				<h3 class="signature">
					"Джек Освальд Уайт (Джокер...)"
				</h3>
			</div>
		</div>
		<noscript>Включите js</noscript>
		<script src="main.js"></script>
	</body>
</html>