// Получаем данные
let quotes = document.getElementById('quotes');

let signature = [
    "Дай человеку второй шанс, и пожалеешь что дал первый.",
    "Злой - Это как добрый, только без лжи и лицимерия.",
    "Я думал, что моя жизнь — трагедия. Но сейчас понял, что это чёртова комедия.",
    "Ты доверяешь - Тебя предают<br>Ты веришь - Тебя обманывают<br>Ты любишь - тебе изменяют<br>И как после этого<br>Не стать бессердечным ублюдком.",
    "Вы считаете меня безумцем,<br>Но посмотрите на себя<br>В вашем мире, все как писал Маяковский<br>'И тети как дяди,<br>и дяди как тети,<br>И люди как черти,<br>и черти как люди'.<br>Ну, и кто безумен теперь ?<br>И это я или мир сошел с ума ?",
    "Для них ты просто псих, как я. Сейчас ты им нужен, а надоешь — они тебя выкинут, как прокажённого. Их принципы, их кодекс — всего лишь слова, забываемые при первой опасности. Они такие, какими мир позволяет им быть.",
    "Комедия субъективна, Мюррей, разве не так говорят? Вы все, система, которая так много знает, вы решаете, что хорошо, а что плохо. Точно так же, вы решаете, что смешно, а что нет."
];

var rand = Math.floor(Math.random() * signature.length);
quotes.innerHTML = signature[rand];

